siva100403/CHEWIE_ASBV21/board/pin_mux.c
    /* PORT3_1 (pin 74) is configured as FC6_P0 */
    PORT_SetPinMux(BOARD_INITPINS_I2C_EEPROM_SDA_PORT, BOARD_INITPINS_I2C_EEPROM_SDA_PIN, kPORT_MuxAlt2);

    PORT3->PCR[1] = ((PORT3->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_12 (pin 65) is configured as PIO3_12 */
    PORT_SetPinMux(BOARD_INITPINS_LID_REV_CTRL_PORT, BOARD_INITPINS_LID_REV_CTRL_PIN, kPORT_MuxAlt0);

    PORT3->PCR[12] = ((PORT3->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_13 (pin 64) is configured as PIO3_13 */
    PORT_SetPinMux(BOARD_INITPINS_SPARE1_CTRL_PORT, BOARD_INITPINS_SPARE1_CTRL_PIN, kPORT_MuxAlt0);

    PORT3->PCR[13] = ((PORT3->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_14 (pin 63) is configured as PIO3_14 */
    PORT_SetPinMux(BOARD_INITPINS_SHD_ONOFF_CTRL_PORT, BOARD_INITPINS_SHD_ONOFF_CTRL_PIN, kPORT_MuxAlt0);

    PORT3->PCR[14] = ((PORT3->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_15 (pin 62) is configured as PIO3_15 */
    PORT_SetPinMux(BOARD_INITPINS_SHD_DIR_CTRL_PORT, BOARD_INITPINS_SHD_DIR_CTRL_PIN, kPORT_MuxAlt0);

    PORT3->PCR[15] = ((PORT3->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_16 (pin 61) is configured as PIO3_16 */
    PORT_SetPinMux(BOARD_INITPINS_HEATER_CTRL_PORT, BOARD_INITPINS_HEATER_CTRL_PIN, kPORT_MuxAlt0);

    PORT3->PCR[16] = ((PORT3->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_17 (pin 60) is configured as PIO3_17 */
    PORT_SetPinMux(BOARD_INITPINS_RTC_INT_PORT, BOARD_INITPINS_RTC_INT_PIN, kPORT_MuxAlt0);

    PORT3->PCR[17] = ((PORT3->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_20 (pin 57) is configured as PIO3_20 */
    PORT_SetPinMux(BOARD_INITPINS_LS_SENSE_LIDOPEN_PORT, BOARD_INITPINS_LS_SENSE_LIDOPEN_PIN, kPORT_MuxAlt0);

    PORT3->PCR[20] = ((PORT3->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_21 (pin 56) is configured as PIO3_21 */
    PORT_SetPinMux(BOARD_INITPINS_LS_SENSE_LIDCLOSE_PORT, BOARD_INITPINS_LS_SENSE_LIDCLOSE_PIN, kPORT_MuxAlt0);

    PORT3->PCR[21] = ((PORT3->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_6 (pin 72) is configured as FC6_P1 */
    PORT_SetPinMux(BOARD_INITPINS_I2C_EEPROM_SCK_PORT, BOARD_INITPINS_I2C_EEPROM_SCK_PIN, kPORT_MuxAlt2);

    PORT3->PCR[6] = ((PORT3->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT4_0 (pin 22) is configured as FC2_P0 */
    PORT_SetPinMux(BOARD_INITPINS_SPI_SDO_PORT, BOARD_INITPINS_SPI_SDO_PIN, kPORT_MuxAlt2);

    PORT4->PCR[0] = ((PORT4->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT4_1 (pin 23) is configured as FC2_P1 */
    PORT_SetPinMux(BOARD_INITPINS_SPI_SCK_PORT, BOARD_INITPINS_SPI_SCK_PIN, kPORT_MuxAlt2);

    PORT4->PCR[1] = ((PORT4->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT4_13 (pin 36) is configured as PIO4_13 */
    PORT_SetPinMux(BOARD_INITPINS_TC78H660_MODE_PORT, BOARD_INITPINS_TC78H660_MODE_PIN, kPORT_MuxAlt0);

    PORT4->PCR[13] = ((PORT4->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT4_15 (pin 37) is configured as PIO4_15 */
    PORT_SetPinMux(BOARD_INITPINS_TC78H660_STBY_PORT, BOARD_INITPINS_TC78H660_STBY_PIN, kPORT_MuxAlt0);

    PORT4->PCR[15] = ((PORT4->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT4_16 (pin 38) is configured as PIO4_16 */
    PORT_SetPinMux(BOARD_INITPINS_MOTOR1_ONOFF_CTRL_PORT, BOARD_INITPINS_MOTOR1_ONOFF_CTRL_PIN, kPORT_MuxAlt0);

    PORT4->PCR[16] = ((PORT4->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

